{"LanguageCode":"en","Id":"yasser-ad-dussary-2","Name":"Yasser Ad-Dussary","ImagePath":"images/reciters/yasser-ad-dussary-2.png","BioText":"<p><strong>Yasser ibn Rashed al-Dosari</strong> (Arabic: ياسر بن راشد الدوسري), born on 6 August 1980, is an imam, khatib, and qāriʾ from Saudi Arabia. He has been one of the imams of Masjid al-Haram since 12 October 2019. Previously, he was an imam of Taraweeh and Tahajjud at Masjid al-Haram from 2015 and also an imam at several mosques in Riyadh since 1995. Al-Dosari was a student of a group of 'ulama and sheikhs, including Abdulaziz Al Sheikh, Saleh Al-Fawzan, and Abdullah ibn Jibreen. He also learned qira'at with several shuyukh and qaris, including Bakri Al-Tarabisyi and Ibrahim Al-Akhdar.</p>\r\n\r\n    <h2>Career</h2>\r\n\r\n    <h3>Imam of Masjid Al-Haram</h3>\r\n    <p>On 29 Sha'ban 1436 H (15 June 2015), King Salman bin Abdulaziz issued an order for Al-Dosari to become one of the Imams of Taraweeh and Tahajjud at Masjid Al-Haram during Ramadan. He carried out that order for five years. On 13 Safar 1441 H (12 October 2019), King Salman appointed Sheikh Yasser as a permanent imam at Masjid Al-Haram. Believed to be the youngest Imam appointed at the Grand Mosque in Makkah, he led his first prayer in Masjid Al-Haram during the Maghrib and Isha Prayers on Saturday, 13 October 2019.</p>\r\n\r\n    <p>Apart from being an imam, Al-Dosari is also an adviser to General Presidency of Haramain since 2020. He was appointed for that position after Abdul-Rahman Al-Sudais, Head of the General Presidency of Haramain, decided to reorganize the ranks of the advisory body of that government agency.</p>\r\n\r\n    <h3>Khatib of Masjid Al-Haram</h3>\r\n    <p>After about three years of becoming an imam of Masjid Al-Haram, Sheikh as-Sudais announced that Al-Dosari was appointed as a khatib of Masjid Al-Haram with King Salman's approval in December 2022.</p>\r\n\r\n    <h3>End of First Contract</h3>\r\n    <p>After completion of his 4-year contract as Imam, Sheikh Yasser was excused from the post in October 2023 Many called for his return, with a survey receiving a 94% pushback against his exemption.</p>\r\n\r\n    <h3>Second Contract</h3>\r\n    <p>Six months after the contract expiration, on Shaʻban 26, 1445 (03/07/2024), Sheikh Abdul Rahman As Sudais announced the re-appointment of Sheikh Yasser Al-Dosari as the Imam of Masjid al-Haram. Sheikh Al-Dosari led the Taraweeh prayers during Ramadan 1445 (2024).</p>\r\n","RecitationStyle":null,"Qirat":null}